# Capstone Two - Data Wrangling

**At this point in this project, we will focus on wrangling our data...data collection, organizing, cleaning, etc.**

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import requests
import io
%matplotlib inline

In [2]:
#Download the csv file and import into dataframe.
url = 'https://raw.githubusercontent.com/GabeGibitz/springboard/master/Capstone/data/raw/bank-additional-full.csv'
s = requests.get(url).content
df = pd.read_csv(io.StringIO(s.decode('utf-8')), sep=';')
df.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [3]:
df.tail()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
41183,73,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41184,46,blue-collar,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41185,56,retired,married,university.degree,no,yes,no,cellular,nov,fri,...,2,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41186,44,technician,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41187,74,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,3,999,1,failure,-1.1,94.767,-50.8,1.028,4963.6,no

## Input variables:

**Bank client data:**
1. age (numeric)
2. job : type of job (categorical: 'admin.','blue-collar','entrepreneur','housemaid','management','retired','self-employed','services','student','technician','unemployed','unknown')
3. marital : marital status (categorical: 'divorced','married','single','unknown'; note: 'divorced' means divorced or widowed)
4. education (categorical: 'basic.4y','basic.6y','basic.9y','high.school','illiterate','professional.course','university.degree','unknown')
5. default: has credit in default? (categorical: 'no','yes','unknown')
6. housing: has housing loan? (categorical: 'no','yes','unknown')
7. loan: has personal loan? (categorical: 'no','yes','unknown')

**Related with the last contact of the current campaign:**
8. contact: contact communication type (categorical: 'cellular','telephone')
9. month: last contact month of year (categorical: 'jan', 'feb', 'mar', ..., 'nov', 'dec')
10. day_of_week: last contact day of the week (categorical: 'mon','tue','wed','thu','fri')
11. duration: last contact duration, in seconds (numeric). Important note: this attribute highly affects the output target (e.g., if duration=0 then y='no'). Yet, the duration is not known before a call is performed. Also, after the end of the call y is obviously known. Thus, this input should only be included for benchmark purposes and should be discarded if the intention is to have a realistic predictive model.

**Other attributes:**
12. campaign: number of contacts performed during this campaign and for this client (numeric, includes last contact)
13. pdays: number of days that passed by after the client was last contacted from a previous campaign (numeric; 999 means client was not previously contacted)
14. previous: number of contacts performed before this campaign and for this client (numeric)
15. poutcome: outcome of the previous marketing campaign (categorical: 'failure','nonexistent','success')

**Social and economic context attributes:**
16. emp.var.rate: employment variation rate - quarterly indicator (numeric)
17. cons.price.idx: consumer price index - monthly indicator (numeric)
18. cons.conf.idx: consumer confidence index - monthly indicator (numeric)
19. euribor3m: euribor 3 month rate - daily indicator (numeric)
20. nr.employed: number of employees - quarterly indicator (numeric)

**Output variable (desired target):**
21. y: has the client subscribed a term deposit? (binary: 'yes','no')

###### Notes:

Will need to address in cleaning:
- job: unknown
- marital: unknown
- education: unknown
- default: unknown
- housing: unknown
- loan: unknown

## Summarizing the Current Dataframe

In [4]:
df.describe()

,age,duration,campaign,pdays,previous,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed
count,41188.00000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000,41188.000000
mean,40.02406,258.285010,2.567593,962.475454,0.172963,0.081886,93.575664,-40.502600,3.621291,5167.035911
std,10.42125,259.279249,2.770014,186.910907,0.494901,1.570960,0.578840,4.628198,1.734447,72.251528
min,17.00000,0.000000,1.000000,0.000000,0.000000,-3.400000,92.201000,-50.800000,0.634000,4963.600000
25%,32.00000,102.000000,1.000000,999.000000,0.000000,-1.800000,93.075000,-42.700000,1.344000,5099.100000
50%,38.00000,180.000000,2.000000,999.000000,0.000000,1.100000,93.749000,-41.800000,4.857000,5191.000000
75%,47.00000,319.000000,3.000000,999.000000,0.000000,1.400000,93.994000,-36.400000,4.961000,5228.100000
max,98.00000,4918.000000,56.000000,999.000000,7.000000,1.400000,94.767000,-26.900000,5.045000,5228.100000

###### Notes:

All values are here and accounted for!

Will need to address in cleaning:
- 999 in pdays
- All values with a "0" in duration

In [5]:
df.shape

(41188, 21)

In [6]:
df['age'].nunique()

78

In [7]:
df[df['duration']==0.0]

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
6251,39,admin.,married,high.school,no,yes,no,telephone,may,tue,...,4,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
23031,59,management,married,university.degree,no,yes,no,cellular,aug,tue,...,10,999,0,nonexistent,1.4,93.444,-36.1,4.965,5228.1,no
28063,53,blue-collar,divorced,high.school,no,yes,no,cellular,apr,fri,...,3,999,0,nonexistent,-1.8,93.075,-47.1,1.479,5099.1,no
33015,31,blue-collar,married,basic.9y,no,no,no,cellular,may,mon,...,2,999,0,nonexistent,-1.8,92.893,-46.2,1.299,5099.1,no

## Data Cleaning

In [8]:
# How many rows were a value of '0' in duration?
nozeros = df[df['duration']==0]
nozeros.shape

(4, 21)

In [9]:
# Get rid of these for predictive modeling because they will result in a "N" every time.
print(df.shape)
df = df[df['duration']!=0]
print(df.shape)

(41188, 21)
(41184, 21)

##### Now, we will turn our string values into workable values (1's and 0's). We also need to address 999 values, months, days of the week, marital status, education and how they were contacted.

In [10]:
# Turn all unknown values into NaN, turn no's to 0 and yes's to 1.
df = df.replace({'no': 0, 'yes': 1, 'unknown': np.NaN})
df.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,0.0,0.0,0.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
1,57,services,married,high.school,NaN,0.0,0.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
2,37,services,married,high.school,0.0,1.0,0.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
3,40,admin.,married,basic.6y,0.0,0.0,0.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
4,56,services,married,high.school,0.0,0.0,1.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0

I'm making a judgement call here on Education. I'll be making 'illiterate' equivalent to '0', assuming that literacy is attained in the first four years of education. This is dataset does not come from America, so we need to set our cultural assumptions aside. From the data here, some go to school for four years, some for 6, some for 9, some for 12 (high school graduate), and so on. I will convert those data points to number of years in school. 

We will also assume that professional schooling is 2 additional years beyond high school and university is 4 additional years beyond high school.

Values will then be as follows:
- 'basic.4y': 4
- 'basic.6y': 6
- 'basic.9y': 9
- 'high.school': 12
- 'illiterate': 0
- 'professional.course': 14
- 'university.degree': 16
- 'unknown': NaN

In [11]:
df['education'] = df['education'].replace({'basic.4y': 4, 
                                           'basic.6y': 6, 
                                           'basic.9y': 9, 
                                           'high.school': 12, 
                                           'illiterate': 0, 
                                           'professional.course': 14, 
                                           'university.degree': 16})
df.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,4.0,0.0,0.0,0.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
1,57,services,married,12.0,NaN,0.0,0.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
2,37,services,married,12.0,0.0,1.0,0.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
3,40,admin.,married,6.0,0.0,0.0,0.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
4,56,services,married,12.0,0.0,0.0,1.0,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0

Now, let's tackle the months and days of the week.

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41184 entries, 0 to 41187
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41184 non-null  int64
 1   job             40854 non-null  object
 2   marital         41104 non-null  object
 3   education       39453 non-null  float64
 4   default         32587 non-null  float64
 5   housing         40194 non-null  float64
 6   loan            40194 non-null  float64
 7   contact         41184 non-null  object
 8   month           41184 non-null  object
 9   day_of_week     41184 non-null  object
 10  duration        41184 non-null  int64
 11  campaign        41184 non-null  int64
 12  pdays           41184 non-null  int64
 13  previous        41184 non-null  int64
 14  poutcome        41184 non-null  object
 15  emp.var.rate    41184 non-null  float64
 16  cons.price.idx  41184 non-null  float64
 17  cons.conf.idx   41184 non-null  float64
 18  euribor3m       41184 non-null  float64
 19  nr.employed     41184 non-null  float64
 20  y               41184 non-null  int64
dtypes: float64(9), int64(6), object(6)
memory usage: 6.9+ MB

In [13]:
df['month'] = df['month'].replace({'jan': 1, 'feb': 2, 'mar': 3, 'apr': 4, 'may': 5, 'jun': 6, 
                                   'jul': 7, 'aug': 8, 'sep': 9, 'oct': 10, 'nov': 11, 'dec': 12})
df.month.head()

0    5
1    5
2    5
3    5
4    5
Name: month, dtype: int64

In [14]:
df.month.value_counts()

5     13767
7      7174
8      6177
6      5318
11     4101
4      2631
10      718
9       570
3       546
12      182
Name: month, dtype: int64

In [15]:
df['day_of_week'] = df['day_of_week'].replace({'mon': 1, 'tue': 2, 'wed': 3, 'thu': 4, 'fri': 5})
df.day_of_week.value_counts()

4    8623
1    8513
3    8134
2    8088
5    7826
Name: day_of_week, dtype: int64

In [16]:
df.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,4.0,0.0,0.0,0.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
1,57,services,married,12.0,NaN,0.0,0.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
2,37,services,married,12.0,0.0,1.0,0.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
3,40,admin.,married,6.0,0.0,0.0,0.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
4,56,services,married,12.0,0.0,0.0,1.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0

Great! We're looking good with months and days of the year! I want to keep the pdays column just in case we need to use it later for some detailed analysis. However, we need to address this somehow. 999 just won't do. What I think I'll do is take out every row that contains a NaN. Then, we will turn the 999 in pdays into NaN. 

Let's tackle this.

In [17]:
df[df.isna().any(axis=1)]

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
1,57,services,married,12.0,NaN,0.0,0.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
5,45,services,married,9.0,NaN,0.0,0.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
7,41,blue-collar,married,NaN,NaN,0.0,0.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
10,41,blue-collar,married,NaN,NaN,0.0,0.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
15,54,retired,married,9.0,NaN,1.0,1.0,telephone,5,1,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41118,34,technician,married,NaN,0.0,1.0,0.0,cellular,11,2,...,2,999,2,failure,-1.1,94.767,-50.8,1.046,4963.6,0
41120,60,admin.,married,NaN,0.0,0.0,0.0,cellular,11,2,...,2,999,0,nonexistent,-1.1,94.767,-50.8,1.046,4963.6,0
41122,34,technician,married,NaN,0.0,0.0,0.0,cellular,11,2,...,3,999,0,nonexistent,-1.1,94.767,-50.8,1.046,4963.6,1
41135,54,technician,married,NaN,0.0,1.0,0.0,cellular,11,4,...,1,999,1,failure,-1.1,94.767,-50.8,1.041,4963.6,0
41175,34,student,single,NaN,0.0,1.0,0.0,cellular,11,4,...,1,999,2,failure,-1.1,94.767,-50.8,1.031,4963.6,0

Wow. One quarter of our data has NaN values. I'd like to decrease that. Which columns have the most NaN values.

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 41184 entries, 0 to 41187
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             41184 non-null  int64
 1   job             40854 non-null  object
 2   marital         41104 non-null  object
 3   education       39453 non-null  float64
 4   default         32587 non-null  float64
 5   housing         40194 non-null  float64
 6   loan            40194 non-null  float64
 7   contact         41184 non-null  object
 8   month           41184 non-null  int64
 9   day_of_week     41184 non-null  int64
 10  duration        41184 non-null  int64
 11  campaign        41184 non-null  int64
 12  pdays           41184 non-null  int64
 13  previous        41184 non-null  int64
 14  poutcome        41184 non-null  object
 15  emp.var.rate    41184 non-null  float64
 16  cons.price.idx  41184 non-null  float64
 17  cons.conf.idx   41184 non-null  float64
 18  euribor3m       41184 non-null  float64
 19  nr.employed     41184 non-null  float64
 20  y               41184 non-null  int64
dtypes: float64(9), int64(8), object(4)
memory usage: 6.9+ MB

It looks like the most values come from the default column (whether or not they have a loan in default). Let's look at our ratios and see if we want to keep them.

In [19]:
df.default.value_counts()

0.0    32584
1.0        3
Name: default, dtype: int64

Oh, there are only 3 out of 30,000 that are in default. We could safely make all of the NaN's a zero, but this is such a small number that we better delete the row altogether.

In [20]:
df = df.drop('default', axis=1)
df.head()

,age,job,marital,education,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,4.0,0.0,0.0,telephone,5,1,261,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
1,57,services,married,12.0,0.0,0.0,telephone,5,1,149,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
2,37,services,married,12.0,1.0,0.0,telephone,5,1,226,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
3,40,admin.,married,6.0,0.0,0.0,telephone,5,1,151,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
4,56,services,married,12.0,0.0,1.0,telephone,5,1,307,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0

In [21]:
df[df.isna().any(axis=1)]

,age,job,marital,education,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
7,41,blue-collar,married,NaN,0.0,0.0,telephone,5,1,217,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
10,41,blue-collar,married,NaN,0.0,0.0,telephone,5,1,55,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
26,59,technician,married,NaN,1.0,0.0,telephone,5,1,93,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
29,55,NaN,married,16.0,NaN,NaN,telephone,5,1,362,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
30,46,admin.,married,NaN,0.0,0.0,telephone,5,1,348,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41118,34,technician,married,NaN,1.0,0.0,cellular,11,2,162,2,999,2,failure,-1.1,94.767,-50.8,1.046,4963.6,0
41120,60,admin.,married,NaN,0.0,0.0,cellular,11,2,333,2,999,0,nonexistent,-1.1,94.767,-50.8,1.046,4963.6,0
41122,34,technician,married,NaN,0.0,0.0,cellular,11,2,985,3,999,0,nonexistent,-1.1,94.767,-50.8,1.046,4963.6,1
41135,54,technician,married,NaN,1.0,0.0,cellular,11,4,222,1,999,1,failure,-1.1,94.767,-50.8,1.041,4963.6,0
41175,34,student,single,NaN,1.0,0.0,cellular,11,4,180,1,999,2,failure,-1.1,94.767,-50.8,1.031,4963.6,0

Great. We are down to less than 10% of the rows with NaN values. We could take more time and match jobs with education levels. But I am going to move forward and simply drop these rows.

In [22]:
print(df.shape)
df.dropna(inplace=True)
print(df.shape)

(41184, 20)
(38241, 20)

In [23]:
df.head()

,age,job,marital,education,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,4.0,0.0,0.0,telephone,5,1,261,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
1,57,services,married,12.0,0.0,0.0,telephone,5,1,149,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
2,37,services,married,12.0,1.0,0.0,telephone,5,1,226,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
3,40,admin.,married,6.0,0.0,0.0,telephone,5,1,151,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
4,56,services,married,12.0,0.0,1.0,telephone,5,1,307,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0

In [24]:
df = df.replace({999: np.NaN, 'nonexistent': np.NaN})
df.head()

,age,job,marital,education,housing,loan,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56.0,housemaid,married,4.0,0.0,0.0,telephone,5.0,1.0,261.0,1.0,NaN,0.0,NaN,1.1,93.994,-36.4,4.857,5191.0,0.0
1,57.0,services,married,12.0,0.0,0.0,telephone,5.0,1.0,149.0,1.0,NaN,0.0,NaN,1.1,93.994,-36.4,4.857,5191.0,0.0
2,37.0,services,married,12.0,1.0,0.0,telephone,5.0,1.0,226.0,1.0,NaN,0.0,NaN,1.1,93.994,-36.4,4.857,5191.0,0.0
3,40.0,admin.,married,6.0,0.0,0.0,telephone,5.0,1.0,151.0,1.0,NaN,0.0,NaN,1.1,93.994,-36.4,4.857,5191.0,0.0
4,56.0,services,married,12.0,0.0,1.0,telephone,5.0,1.0,307.0,1.0,NaN,0.0,NaN,1.1,93.994,-36.4,4.857,5191.0,0.0

In [25]:
df.contact.value_counts()

cellular     24438
telephone    13803
Name: contact, dtype: int64

Looking great! Now, let's export this into a csv for the next step.

In [31]:
cd ..

/Users/gagibitz/Documents/springboard/springboard-git/springboard/Capstone

In [32]:
df.to_csv('data/bank_clean.csv')